# Value Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AddInIdAttribute..::..Value Property
AddInIdAttribute Class See Also
---
AddInId guid value.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ValueType Value { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Value As ValueType
	Get
```

Visual C++
---
```text
public:
property ValueType^ Value {
	ValueType^ get ();
}
```

# See Also
AddInIdAttribute Class
Autodesk.Revit.DB.Macros Namespace